<!DOCTYPE html>
<html>
<head>
<title>MyBB Readme</title>
<style>
body {
	background: url("./Ropack_images/background.png") repeat;
}

#container {
	width: 960px;
	margin: -10px auto;
	font-family: "Lucida Grande",Verdana,Arial,"Bitstream Vera Sans",sans-serif;
	font-size: 13px;
}

#header {
	background: #f5f5f5;
	text-align: center;
	border-left: 1px solid #ddd;
	border-right: 1px solid #ddd;
	border-bottom: 1px solid #ddd;
	padding-top: 10px;
}

#header p {
	text-align: left;
	color: #999;
}

#content {
	background: #fff;
	padding: 20px;
	border-left: 1px solid #ddd;
	border-right: 1px solid #ddd;
}

#footer {
	border-top: 1px solid #ddd;
	color: #999;
	text-align: center;
}

a {
	color: #0072BC;
	text-decoration: none;
}

a:hover {
	text-decoration: underline;
}

h1 {
	color: #aaa;
	font: 24px Georgia,"Times New Roman",Times,serif;
}

h2 {
	color: #666;
	border-bottom: 1px solid #ddd;
	font-weight: normal;
}

p {
	text-indent: 30px;
}

.language {
	font-weight: bold;
}

.folder {
	color: #428bca;
	font-weight: bold;
}

.file {
	color: #5cb85c;
	font-weight: bold;
}

.toc {
	background: #f5f5f5;
	border: 2px solid #ccc;
	border-right: 0;
	color: #111;
	text-align: left;
	clear: both;
	float: right;
	max-width: 320px;
	padding-top: 5px;
	padding-bottom: 5px;
	padding-right: 5px;
	margin-left: 32px;
	margin-bottom: -40px;
	position: relative;
	top: -56px;
}
</style>
</head>
<body>
<div id="container">
	<div id="header">
		<div id="logo">
			<h1>
				<a href="http://www.mybb.ro/" target="_blank"><img src="./Ropack_images/logo.png" width="224" height="75" alt="MyBB Romania"></a>
				<br />
				Versiunea 1.8.7
			</h1>
			<p>Pagina este de asemenea disponibil&#259; &#238;n <a href="./[English]ReadMe.html">Englez&#259;</a>.</p>
		</div>
		<div class="toc">
			<ol class="level-1">
				<li><a href="#introduction">Introducere</a></li>
				<li><a href="#installation">Instalare</a></li>
				<li><a href="#usage">Folosire</a></li>
				<li><a href="#additional_info">Informa&#355;ii adi&#355;ionale</a></li>
		</div>
	</div>
	<div id="content">
		<a name="introduction"></a>
		<h2>Introducere</h2>
		<p>Pentru a satisface c&#226;t mai mul&#355;i utilizatori posibil, MyBB este disponibil &#238;ntr-o mu&#355;ime de limbi. Implicit, MyBB este instalat cu fi&#351;ierele de limba Englez&#259; American&#259;, dar multumit&#259; voluntarilor MyBB, este disponibil &#351;i &#238;n alte limbi. Acest pachet de limb&#259; v&#259; d&#259; posibilitatea s&#259; folosi&#355;i MyBB &#238;n <span class="language">limba rom&#226;n&#259;</span>.</p>
		<br />

		<a name="installation"></a>
		<h2>Instalare</h2>
		<p>Textul &#238;n <span class="language">limba rom&#226;n&#259;</span> este stocat &#238;n fi&#351;ierele de limb&#259;, care sunt &#238;mpachetate &#238;ntr-o arhiv&#259; &#238;mpreun&#259; cu acest fi&#351;ier care con&#355;ine instruc&#355;iunile de instalare &#238;n limba rom&#226;n&#259; &#351;i englez&#259;. Aceste fi&#351;iere de limba sunt &#238;mp&#259;r&#355;ite &#238;n c&#226;teva directoare. De la versiunea 1.8.0 &#238;ncoace, nu mai sunt distribuite imagini odat&#259; cu acest pachet, deoarece fiecare buton este creat &#238;n HTML.</p>
		<p>Acest fi&#351;ier Readme, c&#226;t &#351;i cel &#238;n <span class="language">englez&#259;</span> sunt &#238;n directorul principal. &#206;n subfolderul <span class="folder">Upload</span> se afl&#259; un folder numit <span class="folder">romanian</span> &#351;i fi&#351;ier numit <span class="file">romanian.php</span>, care ofer&#259; informa&#355;ii de baz&#259; despre traducere. Fisierele care con&#355;in traducerea textului pentru forum sunt &#238;ntr-un director numit <span class="folder">romanian</span>, iar fi&#351;ierele care con&#355;in traducerea pentru Panoul de Administrare sunt &#238;ntr-un director numit <span class="folder">admin</span>.</p>
		<p>Va trebui s&#259; crea&#355;i aceea&#351;i structur&#259; de directoare pe serverul vostru &#351;i s&#259; plasa&#355;i fi&#351;ierele de limb&#259; &#238;n aceste directoare. Mai jos sunt instruc&#355;iuni detaliate despre cum s&#259; face&#355;i acest lucru. O s&#259; presupunem c&#259; a&#355;i extras deja con&#355;inutul arhivei pe computerul vostru, ceea ce &#238;nseamn&#259; c&#259; fi&#355;ierele sunt deja disponibile &#351;i structura de directoare este a&#351;a cum trebuie s&#259; fie. O s&#259; mai presupunem c&#259; &#351;ti&#355;i cum s&#259; folosi&#355;i un program FTP pentru a v&#259; conecta la server. Sarcinile de mai jos ar trebui s&#259; poate fi f&#259;cute cu orice program FTP.</p>
		<ol>
			<li>Deschide&#355;i programul FTP &#351;i conecta&#226;i-v&#259; la serverul vostru.</li>
			<li>Naviga&#355;i cu programul FTP la directorul de pe serverul vostru &#238;n care a&#355;i instalat MyBB.</li>
			<li>Naviga&#355;i la directorul de pe server numit <span class="folder">inc</span> &#351;i &#238;n directorul numit <span class="folder">languages</span>, care este locat &#238;n directorul numit <span class="folder">inc</span>. &#206;n directorul <span class="folder">languages</span> ar trebui s&#259; vede&#355;i un director numit <span class="folder">english</span> &#351;i un fi&#351;ier numit <span class="file">english.php</span>.</li>
			<li>Copia&#355;i fi&#351;ierul <span class="file">romanian.php</span> de pe calculatorul vostru &#238;n directorul de pe server. Apoi ar trebui s&#259; &#238;l pute&#355;i g&#259;si &#238;n directorul <span class="folder">languages</span>.</li>
			<li>Dup&#259; aceasta, copiat&#355;i directorul numit <span class="folder">romanian</span> de pe calculatorul vostru &#238;n directorul <span class="folder">languages</span> de pe server.</li>
		</ol>
		<p>Acum a&#355;i &#238;nc&#259;rcat toate fi&#355;ierele necesare pe server. Citi&#355;i urmatoarele paragrafe pentru mai multe informa&#355;ii despre cum s&#259; activa&#355;i limba rom&#226;n&#259; pe forumul vostru.</p>
		<br />

		<a name="usage"></a>
		<h2>Folosire</h2>
		<p>Dupa ce a&#355;i &#238;nc&#259;rcat fi&#351;ierele necesare pute&#355;i folosi traducerea &#238;n limba rom&#226;n&#259; pentru copia voastr&#259; de MyBB. Vom discuta &#238;n continuare despre cum s&#259; folosi&#355;i limba romana pentru forumul vostru &#351;i pentru partea de administrare a forumului &#351;i despre cum s&#259; setati limba rom&#226;n&#259; ca &#351;i limba implicit&#259; pentru forumul vostru. Limba implicit&#259; va fi folosit&#259; de vizitatori &#351;i utilizatori care nu &#351;i-au setat o preferin&#355;&#259; pentru limba &#238;n care s&#259; foloseasc&#259; forumul.</p>
		<ul>
			<li>Pentru a folosi limba rom&#226;n&#259; pentru forum, un utilizator ar trebui s&#259; mearg&#259; la User CP &#351;i s&#259; dea click pe Edit Options. Acolo poate selecta limba rom&#226;n&#259; ca "Board Language" aflat&#259; sub "Other options".</li>
			<li>Pentru a seta limba rom&#226;n&#259; ca &#351;i limba implicit&#259; pentru forumul vostru, administratorul trebuie s&#259; mearg&#259; la Admin CP &#351;i s&#259; dea click pe Configuration. Acolo o s&#259; vad&#259; "General Configuration" &#238;n partea de sus a listei. Apoi trebuie s&#259; dea click pe acel titlu. Apoi va putea selecta limba rom&#226;n&#259; aflat&#259; sub "Default Language" &#351;i s&#259; dea click pe "Save Settings" pentru a salva schimb&#259;rile.</li>
			<li>Pentru a folosi limba romana &#238;n partea de administra&#355;ie a forumului, administratorul trebuie s&#259; mearg&#259; la Admin CP &#351;i s&#259; dea click pe Configuration. &#206;n partea de jos a listei va vedea "Control Panel Preferences (Global)". Apoi trebuie s&#259; dea click pe acel titlu. Apoi poate selecta limba rom&#226;n&#259; sub "Control Panel Language" &#351;i s&#259; dea click pe "Save Settings" pentru a salva schimb&#259;rile.</li>
		</ul>
		<br />

		<a name="additional_info"></a>
		<h2>Informa&#355;ii adi&#355;ionale</h2>
		<p>Daca dori&#355;i s&#259; contacta&#355;i autorii acestei traduceri, v&#259; rug&#259;am s&#259; merge&#355;i &#238;n Admin CP &#351;i da&#355;i click pe Configuration. Dup&#259; aceasta, da&#355;i click pe Languages pentru a vedea modulul de Languages. Acolo ve&#355;i g&#259;si o list&#259; cu pachete de limbi instalate &#351;i un link c&#259;tre siteul autorilor. Pute&#355;i s&#259; da&#355;i click pe link pentru a contacta autorii pachetului de limb&#259;. Sau pute&#355;i merge pe forumul <a href="http://mybb.ro/">MyBB Rom&#226;nia</a>, unde ve&#226;i &#238;nt&#226;lni echipa &#351;i utilizatorii comunit&#259;&#355;ii, ve&#355;i face noi prieteni &#351;i ve&#355;i primi ajutor la orice problem&#259; pute&#355;i &#238;nt&#226;mpina cu forumul dumneavoastr&#259;.</p>
	</div>
	<div id="footer">
		<p>
			Copyright &copy; 2014 <a href="http://mybb.ro/">MyBB Romania</a>. Toate drepturile rezervate.
		</p>
	</div>
</div>
</body>
</html>